Repository: CesarG503/math_solver
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: NavInicio
es: Inicio

source: NavTeoria
es: Teoría

source: NavManual
es: Manual

source: NavNosotros
es: Nosotros

source: HeroTitulo
es: Método Simplex

source: HeroSubtitulo
es: Documentación

source: HeroDescripcion
es: El método Simplex es detallado y propenso a errores si se falla en un cálculo. Por eso, es clave entender cada paso del proceso.

source: HeroBotonComenzar
es: Comenzar

source: HeroBotonProyecto
es: Proyecto

source: Section2Title
es: ¿Qué es el método Simplex?

source: Section2Description
es: El método Simplex es un procedimiento iterativo para resolver problemas de programación lineal, donde se busca obtener la solución óptima de la función objetivo que logre cumplir el conjunto de restricciones.

source: CardTitle
es: Conceptos Básicos

source: CardIntro
es: Para comprender de mejor manera el método Simplex vamos a revisar algunas definiciones. El método parte de dos afirmaciones importantes.

source: CardPoint1
es: El conjunto de posibles soluciones o conjunto factible de cualquier problema de programación lineal puede representarse mediante un poliedro convexo.

source: CardPoint2
es: Si un problema de programación lineal tiene una solución óptima y finita, ésta estará en un vértice del poliedro convexo que representa al problema.

source: StepsTitle
es: Pasos del Método Simplex

source: StepsPoint1
es: Definir el problema en la forma estándar y generar nuestra matriz.

source: StepsPoint2
es: Determinar la solución básica inicial.

source: StepsPoint3
es: Seleccionar la variable de entrada utilizando la condición de optimalidad. Si no se puede seleccionar una variable de entrada, quiere decir que estamos en la condición óptima y finalizan las iteraciones. De otro modo se continúa con el siguiente paso.

source: StepsPoint4
es: Seleccionar la variable de salida utilizando la condición de factibilidad.

source: StepsPoint5
es: Actualizar nuestra matriz realizando las operaciones de Gauss-Jordan. Volver al paso número 3.

source: Detail1Title
es: Pasos del Método Simplex explicados a detalle

source: Detail1Step1Summary
es: Definir el problema en la forma estándar y generar nuestra matriz

source: Detail1Intro
es: Un problema de programación lineal tiene la siguiente forma

source: DetailObjectiveHeader
es: Función Objetivo

source: DetailObjectiveAction
es: Maximizar o Minimizar

source: DetailSubjectToHeader
es: Sujeto a

source: DetailConstraint1
es: c_{11}x_1 + c_{12}x_2 + … + c_{1n}x_n (≥, ≤, =) b_1

source: DetailConstraint2
es: c_{21}x_1 + c_{22}x_2 + … + c_{2n}x_n (≥, ≤, =) b_2

source: DetailConstraintN
es: c_{m1}x_1 + c_{m2}x_2 + … + c_{mn}x_n (≥, ≤, =) b_m

source: DetailNonNegativity
es: x_1 ≥ 0, x_2 ≥ 0, …, x_n ≥ 0

source: DetailVariablesNote
es: Donde x₁, x₂, …, xₙ son las variables del problema.

source: PreStandardNote
es: Antes de llevar nuestro modelo a la forma estándar debemos verificar que todas las restricciones tienen el lado derecho no negativo.

source: NegativeSideQuestion
es: ¿Qué hago si el lado derecho de la restricción es negativo?

source: NegativeSideExplanation
es: Cuando el término independiente de la restricción es negativo, se debe multiplicar por -1 toda la restricción —incluyendo su signo— para hacer el lado derecho positivo.

source: NegativeStep1
es: Si la restricción es del tipo mayor igual (≥), se deberá cambiar a menor igual (≤).

source: NegativeStep2
es: Si la restricción es del tipo menor igual (≤), se deberá cambiar a mayor igual (≥).

source: NegativeStep3
es: Si la restricción es una igualdad, el signo se mantiene.

source: ConvertToEqualitiesTitle
es: Convertir restricciones en igualdades

source: ConvertToEqualitiesNote
es: Para convertir las restricciones en igualdades va a depender de su signo

source: CaseLessEqual
es: Si la restricción es menor igual (≤):

source: CaseLessEqualDesc
es: Para este tipo de restricciones debemos introducir una variable de holgura no negativa.

source: CaseGreaterEqual
es: Si la restricción es mayor igual (≥):

source: CaseGreaterEqualDesc
es: Se debe restar una variable de exceso y agregar una variable artificial.

source: CaseEqual
es: Si la restricción es igual (=):

source: CaseEqualDesc
es: Se debe restar una variable de exceso y agregar una variable artificial.

source: SimplexMethodScope
es: El método Simplex que abordaremos en esta entrada se utiliza para problemas de programación lineal con restricciones ≤. Para variables artificiales use el método de dos fases o la M Grande.

source: GenerateMatrixTitle
es: Generar la matriz del problema

source: GenerateMatrixIntro
es: Una vez que tenemos nuestro problema en forma estándar, debemos generar la matriz con los coeficientes de la función objetivo y las restricciones.

source: AfterConstraintsConverted
es: Una vez convertidas las restricciones en ecuaciones, procedemos a generar nuestra matriz:

source: MatrixOverview
es: En nuestra matriz podemos identificar lo siguiente:

source: MatrixItem1Title
es: Vector de Costes:

source: MatrixItem1Desc
es: Contiene los coeficientes de todas las variables de la función objetivo; debajo se muestran las variables en orden.

source: MatrixItem2Title
es: Vector Solución:

source: MatrixItem2Desc
es: Columna con la solución básica inicial; en Cb se indica el coeficiente de cada variable en el vector de costes.

source: MatrixItem3Title
es: Coeficientes Restricciones:

source: MatrixItem3Desc
es: Coeficientes de las restricciones en el orden original; la columna R es el vector de recursos.

source: MatrixItem4Title
es: Vector de costes reducidos:

source: MatrixItem4Desc
es: También llamado precios sombra: se calcula multiplicando el vector solución por los coeficientes de las restricciones y restando el vector de costes.

source: Detail2Summary
es: Determinar la solución básica inicial

source: Detail2Description1
es: Como habíamos mencionado, el método Simplex parte de un vértice de la región factible, es decir, un punto extremo. Con cada iteración avanzaremos de vértice en vértice hasta llegar a la solución óptima. En nuestro caso, en la matriz elaborada podemos ver la solución básica inicial que sería S₁=35, S₂=18 y S₃=26; cada variable del vector solución se iguala al valor que se encuentra en la columna R. Estas variables se denominan variables básicas. El valor de Z inicial también se muestra en la columna R y es 0.

source: Detail2Description2
es: Las variables que no se encuentran en la base se denominan variables no básicas y, en este caso, serían X₁ y X₂, ambas con valor 0. ¿Con esta solución tenemos el mejor valor de Z? Para saberlo debemos continuar al siguiente paso:

source: Detail3Summary
es: Seleccionar la variable de entrada utilizando la condición de optimalidad

source: Detail3OptimalityTitle
es: Condición de Optimalidad

source: Detail3OptimalityDesc
es: La condición de optimalidad consiste en verificar si la solución actual en la matriz es la óptima o si se puede mejorar.

source: Detail3OptimalityPoint1
es: En un problema de maximización, si todos los coeficientes del vector de costes reducidos son ≥ 0, estamos en el punto óptimo y finaliza el problema.

source: Detail3OptimalityPoint2
es: Si un problema de programación lineal tiene una solución óptima y finita, ésta estará en un vértice del poliedro convexo que representa al problema.

source: Detail3OptimalityNote
es: Siguiendo con el ejemplo de maximización, existen valores negativos en el vector de costes reducidos; por tanto, debemos iniciar las iteraciones seleccionando la variable de entrada.

source: Detail3EntryVarTitle
es: Variable de Entrada

source: Detail3EntryVarDesc1
es: La variable de entrada es una de las variables no básicas que ingresará a la base y formará parte de la solución.

source: Detail3EntryVarDesc2
es: Los criterios para seleccionar la variable de entrada dependen de si el problema es de maximización o minimización:

source: Detail3EntryVarPoint1
es: Para maximización, será la variable no básica con el coeficiente más negativo en el vector de costes reducidos.

source: Detail3EntryVarPoint2
es: Para minimización, será la variable no básica con el coeficiente más positivo en el vector de costes reducidos.

source: Detail3PivotNote
es: La columna donde está ubicada la variable se denomina columna pivote.

source: Detail3ExampleNote
es: En el ejemplo, la variable de entrada es X₁, ya que tiene el valor más negativo («-3») en el vector de costes reducidos:

source: Detail4Summary
es: Seleccionar la Variable de Salida con la Condición de Factibilidad

source: Detail4FeasibilityTitle
es: Condición de Factibilidad

source: Detail4FeasibilityDesc1
es: La condición de factibilidad se utiliza para determinar cuál de las variables básicas saldrá de la base y será reemplazada por la variable de entrada. Para esto se utiliza el criterio de la razón mínima.

source: Detail4FeasibilityDesc2
es: La razón mínima se calcula dividiendo el valor de la columna R entre el valor de la columna pivote. El resultado nos indica cuál es la variable que saldrá de la base; la que tenga el menor resultado será la que salga.

source: Detail4FeasibilityDesc3
es: Si el resultado de la razón mínima es negativo o cero, significa que no hay variable que salga de la base y el problema no tiene solución.

source: Detail4ExitVarTitle
es: Variable de Salida

source: Detail4ExitVarDesc1
es: Para determinar la variable que sale de la base se divide el valor de la columna R entre su coeficiente en la columna de la variable de entrada, siempre que este coeficiente sea positivo.

source: Detail4ExitVarDesc2
es: El menor de los resultados corresponde a la fila pivote, que contiene la variable de salida.

source: Detail4Example1
es: En nuestro ejemplo, la columna pivote es la de la variable de entrada X₁. La fila pivote es la que tiene el menor valor al dividir el valor de R entre el coeficiente de la columna pivote; aquí, S₂ (18/3=6).

source: Detail4Example2
es: La variable de salida sería S₂. El número en la intersección de la fila pivote y la columna pivote es el elemento pivote; en este caso es 3.

source: Detail5Summary
es: Actualizar la Matriz

source: Detail5Intro
es: Una vez determinado nuestro elemento pivote, realizaremos las operaciones de Gauss-Jordan para formar nuestra matriz identidad. El nuevo valor de cada fila se calculará de la siguiente manera:

source: Detail5PivotTitle
es: Para la fila pivote:

source: Detail5PivotDesc
es: El nuevo valor de la fila pivote se obtendrá dividiendo el valor actual entre el elemento pivote.

source: Detail5OtherTitle
es: Para las otras filas:

source: Detail5OtherDesc
es: El nuevo valor de cada fila se calcula restando del valor actual la multiplicación del elemento de la fila que se encuentra en la columna pivote por el nuevo valor calculado de la fila pivote.

source: Detail5ExampleIntro
es: Para entenderlo mejor, continuaremos resolviendo el ejemplo. Iniciaremos con la fila pivote:

source: Detail5AfterpivotIntro
es: En las otras filas realizaremos los cálculos de forma diferente. Iniciaremos con la fila de S₁:

source: Detail5RowS3Intro
es: Para la fila S₃ tenemos:

source: Detail5RowZIntro
es: Finalmente, para la fila de Z tenemos:

source: Detail5PostOperations
es: Una vez que hemos realizado las operaciones de Gauss-Jordan, nuestra matriz queda de la siguiente manera:

source: Detail5MatrixIdentityDesc
es: Como puedes ver, la posición donde se encontraba nuestro elemento pivote ahora es 1 y los elementos que lo acompañan en la columna se convierten en 0. Así empezamos a formar nuestra matriz identidad.

source: Detail5ReturnStep
es: Volver al paso número 3

source: Detail5ReturnDesc
es: Con este último resultado, volveremos al paso 3 y repetiremos el proceso. Como existen valores negativos en el vector de costes reducidos, podemos seguir optimizando.

source: Detail5NegativeValueDesc
es: El único valor negativo es -4, por lo que la variable que ingresará es X₂.

source: Detail5ChooseExitVarDesc
es: Para elegir la variable que va a salir, dividimos cada valor de la columna R por su contraparte de la columna X₂ (este último valor debe ser positivo).

source: Detail5IgnoreNegative
es: El valor de la columna X₂ es negativo, por lo que no se toma en cuenta.

source: Detail5SmallestValueDesc
es: El menor valor se encuentra en la fila de S₃, por lo que es la variable que saldrá de la base. El elemento pivote es 16/3.

source: Detail5NextIterationIntro
es: Realizamos nuevamente las iteraciones obteniendo el siguiente resultado:

source: Detail5OptReached
es: En esta última matriz vemos que el vector de costes reducidos ya no tiene ningún valor negativo, lo que quiere decir que nos encontramos en el valor óptimo. Obtendremos los valores de las variables básicas y de Z de la siguiente forma:

source: Detail5NonBasisZero
es: Las variables que no se encuentran en la base tendrán valor de 0.

source: Detail5Solution
es: Solución: X₁ = 31/4, X₂ = 21/8, S₁ = 51/8, S₂ = 0, S₃ = 0, Z = 57/2

source: AlertTextPrefix
es: Esta teoría ha sido extraída de la siguiente fuente:

source: AlertTextLink
es: Plan de Mejora

source: Section3Title
es: Manual de Usuario

source: Section3Description
es: Aquí encontrarás instrucciones paso a paso para ingresar datos, interpretar resultados y sacar el máximo provecho de la herramienta.

source: ManualSectionTitle
es: Explicación paso a paso de cómo resolver un ejercicio

source: ManualStep1Title
es: Introducir los valores a la calculadora

source: ManualStep1ImageAlt
es: Captura de pantalla de la sección de entrada de valores

source: ManualStep1Item1
es: Se puede elegir el tipo de problema que se desea resolver, ya sea de Maximización o Minimización. Puedes elegir la cantidad de variables que deseas utilizar, desde 2 hasta X variables.

source: ManualStep1Item2
es: Puedes asignar nombre a las variables; por defecto vienen x₁, x₂ … xₙ.

source: ManualStep1Item3
es: Apartado para subir los valores de la Función Objetivo, cada uno siguiendo el orden de las variables.

source: ManualStep2ImageAlt
es: Captura de pantalla de la sección de restricciones

source: ManualStep2Item4
es: El botón de eliminar sirve para eliminar una restricción que ya no se necesite o si has agregado más restricciones.

source: ManualStep2Item5
es: El cuadro de restricciones es el lugar donde se ingresan las restricciones del problema; cada restricción debe seguir el orden de las variables.

source: ManualStep2Item6
es: El botón de agregar sirve para añadir una restricción más si se desea. El botón de carga de ejemplo inserta un problema de programación lineal de muestra para que puedas ver cómo funciona la app.

source: ManualStep2Item7
es: El botón de resolver sirve para resolver el problema una vez que se han ingresado todos los valores necesarios.

source: ManualStep2Item8
es: El cuadro de previsualización sirve para ver cómo se mostrará el problema ingresado antes de resolverlo.

source: ManualResultsTitle
es: Muestra de Resultados

source: ManualResultsImageAlt
es: Captura de pantalla del cuadro de respuesta rápida

source: ManualResultsItem1
es: El cuadro de Respuesta Rápida muestra la solución para quienes no desean ver todo el proceso.

source: ManualResultsDetailImageAlt
es: Captura de pantalla del cuadro paso a paso

source: ManualResultsItem2
es: El cuadro paso a paso muestra cómo se ha resuelto el problema, explicando cada paso detalladamente.

source: TeamSectionTitle
es: EQUIPO DE DESARROLLO

source: ToolDescription
es: Una herramienta avanzada para resolver problemas de programación lineal utilizando el método Simplex.

source: ProjectInfoTitle
es: Información del Proyecto

source: ProjectInfoDesc
es: Proyecto desarrollado como parte de la materia Método de optimización.

source: ButtonStart
es: Comenzar

source: ButtonProject
es: Proyecto

source: UniversityName
es: UNIVERSIDAD NACIONAL DE EL SALVADOR

source: FooterCopyright
es: Math Solver. Todos los derechos reservados.
